**********************************
**作成者：松木、梶原
**********************************
	.include "queue.s"
	
	.section .text
*************************************************
**受信データを受信キューに格納する
**入力：チャネルch(%d1.l)
**      受信データdata(%d2.b)
**出力：なし
*************************************************

INTERGET:
        movem.l %d0-%d1,-(%sp)
        cmpi.l  #0,%d1
        bne     END_INTERGET
        move.l  #0,%d0
        move.l  %d2,%d1
        bra     INQ

END_INTERGET:
        movem.l (%sp)+,%d0-%d1
        rts
        
